{"config": [{"config": {"recurrent_constraint": null, "go_backwards": false, "use_bias": true, "implementation": 1, "activity_regularizer": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "return_sequences": false, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "batch_input_shape": [null, 1, 40], "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "lstm_1", "bias_constraint": null, "recurrent_regularizer": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "units": 40, "stateful": false, "return_state": false, "trainable": true, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.25, "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "activation": "softmax", "name": "dense_1", "use_bias": true, "units": 9, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.0"}