{"keras_version": "2.2.0", "config": [{"config": {"activity_regularizer": null, "batch_input_shape": [null, 1, 40], "return_state": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dropout": 0.0, "implementation": 1, "name": "lstm_5", "units": 40, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "trainable": true, "unroll": false, "kernel_regularizer": null, "activation": "tanh", "go_backwards": false, "use_bias": true}, "class_name": "LSTM"}, {"config": {"seed": null, "trainable": true, "name": "dropout_5", "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_5", "units": 8, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}